src/de/htw/ds/chat/chat-service.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://chat.ds.htw.de/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://chat.ds.htw.de/" name="SoapChatService">
	<types>
		<xsd:element name="addEntry" type="tns:addEntry" />
		<xsd:element name="addEntryResponse" type="tns:addEntryResponse" />
		<xsd:element name="getEntries" type="tns:getEntries" />
		<xsd:element name="getEntriesResponse" type="tns:getEntriesResponse" />
		<xsd:element name="removeEntry" type="tns:removeEntry" />
		<xsd:element name="removeEntryResponse" type="tns:removeEntryResponse" />

		<xsd:complexType name="addEntry">
			<xsd:sequence>
				<xsd:element name="alias" type="xsd:string" minOccurs="0" />
				<xsd:element name="content" type="xsd:string" minOccurs="0" />
			</xsd:sequence>
		</xsd:complexType>

		<xsd:complexType name="addEntryResponse">
			<xsd:sequence>
				<xsd:element name="return" type="xsd:long" />
			</xsd:sequence>
		</xsd:complexType>

		<xsd:complexType name="getEntries">
			<xsd:sequence />
		</xsd:complexType>

		<xsd:complexType name="getEntriesResponse">
			<xsd:sequence>
				<xsd:element name="return" type="tns:chatEntry" nillable="true" minOccurs="0" maxOccurs="unbounded" />
			</xsd:sequence>
		</xsd:complexType>

		<xsd:complexType name="chatEntry" final="extension restriction">
			<xsd:sequence>
				<xsd:element name="alias" type="xsd:string" minOccurs="0" />
				<xsd:element name="content" type="xsd:string" minOccurs="0" />
				<xsd:element name="timestamp" type="xsd:long" />
			</xsd:sequence>
		</xsd:complexType>

		<xsd:complexType name="removeEntry">
			<xsd:sequence>
				<xsd:element name="entry" type="tns:chatEntry" minOccurs="0" />
			</xsd:sequence>
		</xsd:complexType>

		<xsd:complexType name="removeEntryResponse">
			<xsd:sequence>
				<xsd:element name="return" type="xsd:boolean" />
			</xsd:sequence>
		</xsd:complexType>
	</types>

	<message name="addEntry">
		<part name="parameters" element="tns:addEntry" />
	</message>
	<message name="addEntryResponse">
		<part name="parameters" element="tns:addEntryResponse" />
	</message>
	<message name="removeEntry">
		<part name="parameters" element="tns:removeEntry" />
	</message>
	<message name="removeEntryResponse">
		<part name="parameters" element="tns:removeEntryResponse" />
	</message>
	<message name="getEntries">
		<part name="parameters" element="tns:getEntries" />
	</message>
	<message name="getEntriesResponse">
		<part name="parameters" element="tns:getEntriesResponse" />
	</message>

	<portType name="SoapChatService">
		<operation name="addEntry">
			<input wsam:Action="http://chat.ds.htw.de/SoapChatService/addEntryRequest" message="tns:addEntry" />
			<output wsam:Action="http://chat.ds.htw.de/SoapChatService/addEntryResponse" message="tns:addEntryResponse" />
		</operation>
		<operation name="removeEntry">
			<input wsam:Action="http://chat.ds.htw.de/SoapChatService/removeEntryRequest" message="tns:removeEntry" />
			<output wsam:Action="http://chat.ds.htw.de/SoapChatService/removeEntryResponse" message="tns:removeEntryResponse" />
		</operation>
		<operation name="getEntries">
			<input wsam:Action="http://chat.ds.htw.de/SoapChatService/getEntriesRequest" message="tns:getEntries" />
			<output wsam:Action="http://chat.ds.htw.de/SoapChatService/getEntriesResponse" message="tns:getEntriesResponse" />
		</operation>
	</portType>

	<binding name="SoapChatPortBinding" type="tns:SoapChatService">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
		<operation name="addEntry">
			<soap:operation soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
		<operation name="removeEntry">
			<soap:operation soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
		<operation name="getEntries">
			<soap:operation soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
	</binding>

	<service name="SoapChatService">
		<port name="SoapChatPort" binding="tns:SoapChatPortBinding">
			<soap:address location="http://tabernakel:8003/ChatService" />
		</port>
	</service>
</definitions>